import TempImg from '../assets/RequestList/RequestDetail/temp-picture.png';

export const ProjectListMocks = {
  doing: [
    {
      id: 1,
      thumbnail: TempImg,
      title: '퍼스널 헬스케어 플랫폼',
      user: '김모락',
      status: '요구사항 확인 필요',
      finishDate: '마감 D-17',
      detailSections: [
        {
          header: '주요기능',
          summary:
            '사용자의 건강 데이터를 통합 관리하고, 목표 달성을 지원하는 퍼스널 헬스케어 플랫폼',
          items: [
            '사용자의 건강 데이터를 통합 관리하고, 목표 달성을 지원하는 퍼스널 헬스케어 플랫폼',
            '건강 상태 트래킹 (예: 수면, 운동, 심박수, 혈압 등)',
            '건강 목표 설정 및 진행율 확인',
            '맞춤형 건강 피드백 및 알림 제공',
            '식단 및 물 섭취 기록 기능',
            '타깃 사용자: 20~50대 남녀, 건강을 꾸준히 관리하고자 하는 일반인 및 헬스케어 관심층',
          ],
        },
        {
          header: '톤앤매너',
          summary: '',
          items: [
            '밝고 신뢰감 있는 색감 사용 (예: 화이트 배경 중심에 블루/민트 계열 포인트 컬러)',
            '너무 병원스럽지 않되, 전문성과 안정감이 느껴지는 스타일',
            '전체적으로 클린하고 여백이 잘 살아있는 UI 요청드립니다',
          ],
        },
        {
          header: 'UX 원칙',
          summary: '',
          items: [
            '사용자가 처음 접해도 쉽게 이해하고 사용할 수 있도록 직관적인 구조로 설계해주세요',
            '정보의 계층 구조가 명확해야, 솔루션 전체(터치/스크롤)가 자연스러운 흐름으로 구성되어야 합니다',
            '자주 사용하는 기능은 하단 탭 또는 메인화면 상단에 고정하여 접근성을 높여주세요',
            '피드백이나 알림은 부드러운 애니메이션 또는 아이콘 강조로 거부감 없이 전달되게 구성 바랍니다',
          ],
        },
      ],
    },
    {
      id: 2,
      thumbnail: TempImg,
      title: '독서 챌린지 커뮤니티 앱',
      user: '이모락',
      status: '작업 중',
      finishDate: '마감 D-35',
      detailSections: [
        {
          header: '주요기능',
          summary: '',
          items: [
            '사용자의 건강 데이터를 통합 관리하고, 목표 달성을 지원하는 퍼스널 헬스케어 플랫폼',
            '건강 상태 트래킹 (예: 수면, 운동, 심박수, 혈압 등)',
            '건강 목표 설정 및 진행율 확인',
            '맞춤형 건강 피드백 및 알림 제공',
            '식단 및 물 섭취 기록 기능',
            '타깃 사용자: 20~50대 남녀, 건강을 꾸준히 관리하고자 하는 일반인 및 헬스케어 관심층',
          ],
        },
        {
          header: '톤앤매너',
          summary: '',
          items: [
            '클린하고 신선한 인상의 컬러 사용 (예: 크림 화이트 배경에 민트/그린/오렌지 계열 포인트)',
            '과장되지 않은 사실적인 광택/재질 표현 (매트 + 살짝 반사되는 플라스틱 느낌)',
            '제품이 건강하고 가볍게 느껴지도록 밝고 생동감 있는 조명 설정',
            '사용자가 제품 크기, 질감, 형태를 한눈에 파악할 수 있도록 각도별 보기 제공',
            '정면 뷰 → 45도 뷰 → 측면 뷰 → 뚜껑 상단 등의 구조로 목업 구성',
          ],
        },
        {
          header: 'UX 원칙',
          summary: '',
          items: [
            '사용자가 처음 접해도 쉽게 이해하고 사용할 수 있도록 직관적인 구조로 설계해주세요',
            '정보의 계층 구조가 명확해야, 솔루션 전체(터치/스크롤)가 자연스러운 흐름으로 구성되어야 합니다',
            '자주 사용하는 기능은 하단 탭 또는 메인화면 상단에 고정하여 접근성을 높여주세요',
            '피드백이나 알림은 부드러운 애니메이션 또는 아이콘 강조로 거부감 없이 전달되게 구성 바랍니다',
          ],
        },
      ],
    },
    {
      id: 3,
      thumbnail: TempImg,
      title: '퍼스널 헬스케어 플랫폼',
      user: '이모락',
      status: '요구사항 확인 필요',
      finishDate: '마감 D-67',
      detailSections: [
        {
          header: '222주요기능',
          summary: '',
          items: [
            '사용자의 건강 데이터를 통합 관리하고, 목표 달성을 지원하는 퍼스널 헬스케어 플랫폼',
            '건강 상태 트래킹 (예: 수면, 운동, 심박수, 혈압 등)',
            '건강 목표 설정 및 진행율 확인',
            '맞춤형 건강 피드백 및 알림 제공',
            '식단 및 물 섭취 기록 기능',
            '타깃 사용자: 20~50대 남녀, 건강을 꾸준히 관리하고자 하는 일반인 및 헬스케어 관심층',
          ],
        },
        {
          header: '톤앤매너',
          summary: '',
          items: [
            '클린하고 신선한 인상의 컬러 사용 (예: 크림 화이트 배경에 민트/그린/오렌지 계열 포인트)',
            '과장되지 않은 사실적인 광택/재질 표현 (매트 + 살짝 반사되는 플라스틱 느낌)',
            '제품이 건강하고 가볍게 느껴지도록 밝고 생동감 있는 조명 설정',
            '사용자가 제품 크기, 질감, 형태를 한눈에 파악할 수 있도록 각도별 보기 제공',
            '정면 뷰 → 45도 뷰 → 측면 뷰 → 뚜껑 상단 등의 구조로 목업 구성',
          ],
        },
        {
          header: 'UX 원칙',
          summary: '',
          items: [
            '사용자가 처음 접해도 쉽게 이해하고 사용할 수 있도록 직관적인 구조로 설계해주세요',
            '정보의 계층 구조가 명확해야, 솔루션 전체(터치/스크롤)가 자연스러운 흐름으로 구성되어야 합니다',
            '자주 사용하는 기능은 하단 탭 또는 메인화면 상단에 고정하여 접근성을 높여주세요',
            '피드백이나 알림은 부드러운 애니메이션 또는 아이콘 강조로 거부감 없이 전달되게 구성 바랍니다',
          ],
        },
      ],
    },
  ],
  finish: [
    {
      id: 4,
      thumbnail: TempImg,
      title: '꽃가게 로고 디자인 요청',
      user: '이모락',
      date: '2025.07.22',
      detailSections: [
        {
          header: '주5요기능',
          summary:
            ' 사용자의 건강 데이터를 통합 관리하고, 목표 달성을 지원하는 퍼스널 헬스케어 플랫폼',
          items: [
            '사용자의 건강 데이터를 통합 관리하고, 목표 달성을 지원하는 퍼스널 헬스케어 플랫폼',
            '건강 상태 트래킹 (예: 수면, 운동, 심박수, 혈압 등)',
            '건강 목표 설정 및 진행율 확인',
            '맞춤형 건강 피드백 및 알림 제공',
            '식단 및 물 섭취 기록 기능',
            '타깃 사용자: 20~50대 남녀, 건강을 꾸준히 관리하고자 하는 일반인 및 헬스케어 관심층',
          ],
        },
        {
          header: '톤앤매너',
          summary: '',
          items: [
            '클린하고 신선한 인상의 컬러 사용 (예: 크림 화이트 배경에 민트/그린/오렌지 계열 포인트)',
            '과장되지 않은 사실적인 광택/재질 표현 (매트 + 살짝 반사되는 플라스틱 느낌)',
            '제품이 건강하고 가볍게 느껴지도록 밝고 생동감 있는 조명 설정',
            '사용자가 제품 크기, 질감, 형태를 한눈에 파악할 수 있도록 각도별 보기 제공',
            '정면 뷰 → 45도 뷰 → 측면 뷰 → 뚜껑 상단 등의 구조로 목업 구성',
          ],
        },
        {
          header: 'UX 원칙',
          summary: '',
          items: [
            '사용자가 처음 접해도 쉽게 이해하고 사용할 수 있도록 직관적인 구조로 설계해주세요',
            '정보의 계층 구조가 명확해야, 솔루션 전체(터치/스크롤)가 자연스러운 흐름으로 구성되어야 합니다',
            '자주 사용하는 기능은 하단 탭 또는 메인화면 상단에 고정하여 접근성을 높여주세요',
            '피드백이나 알림은 부드러운 애니메이션 또는 아이콘 강조로 거부감 없이 전달되게 구성 바랍니다',
          ],
        },
      ],
    },
    {
      id: 5,
      thumbnail: TempImg,
      title: '패키지 디자인 3d 목업',
      user: '이모락',
      date: '2025.03.15',
      detailSections: [
        {
          header: '11주요기능',
          summary:
            '사용자의 건강 데이터를 통합 관리하고, 목표 달성을 지원하는 퍼스널 헬스케어 플랫폼',
          items: [
            '사용자의 건강 데이터를 통합 관리하고, 목표 달성을 지원하는 퍼스널 헬스케어 플랫폼',
            '건강 상태 트래킹 (예: 수면, 운동, 심박수, 혈압 등)',
            '건강 목표 설정 및 진행율 확인',
            '맞춤형 건강 피드백 및 알림 제공',
            '식단 및 물 섭취 기록 기능',
            '타깃 사용자: 20~50대 남녀, 건강을 꾸준히 관리하고자 하는 일반인 및 헬스케어 관심층',
          ],
        },
        {
          header: '톤앤매너',
          summary: '',
          items: [
            '클린하고 신선한 인상의 컬러 사용 (예: 크림 화이트 배경에 민트/그린/오렌지 계열 포인트)',
            '과장되지 않은 사실적인 광택/재질 표현 (매트 + 살짝 반사되는 플라스틱 느낌)',
            '제품이 건강하고 가볍게 느껴지도록 밝고 생동감 있는 조명 설정',
            '사용자가 제품 크기, 질감, 형태를 한눈에 파악할 수 있도록 각도별 보기 제공',
            '정면 뷰 → 45도 뷰 → 측면 뷰 → 뚜껑 상단 등의 구조로 목업 구성',
          ],
        },
        {
          header: 'UX 원칙',
          summary: '',
          items: [
            '사용자가 처음 접해도 쉽게 이해하고 사용할 수 있도록 직관적인 구조로 설계해주세요',
            '정보의 계층 구조가 명확해야, 솔루션 전체(터치/스크롤)가 자연스러운 흐름으로 구성되어야 합니다',
            '자주 사용하는 기능은 하단 탭 또는 메인화면 상단에 고정하여 접근성을 높여주세요',
            '피드백이나 알림은 부드러운 애니메이션 또는 아이콘 강조로 거부감 없이 전달되게 구성 바랍니다',
          ],
        },
      ],
    },
  ],
};
